#include "SBT_class.h"
#include <iostream>
#include <ctime>
using namespace std;

/*
76. Self-Balancing Binary Search Tree (AVL Tree)

Реализовать:

+ `Insert` + автоматическая балансировка
+ `Search`
- `Delete` + автоматическая балансировка
+ поиск минимального элемента
+ поиск максимального элемента
+ обход дерева (`inorder = l -> n -> r`)
+ вычисление высоты узла (`height`) 
+ вычисление баланс-фактора (`balanceFactor`)
+ левый поворот (`rotateLeft`)
+ правый поворот (`rotateRight`)
+ балансировка узла (`balance`)
+ обработка всех 4 случаев дисбаланса: LL, RR, LR, RL
- `clear()`
- деструктор AVL Tree

Тренирует: самобалансировку деревьев, рекурсивную перестройку структуры, 
//работу с указателями, анализ высоты, повороты дерева и поддержание свойств BST после вставки и удаления.

Критерии корректности:
- сохраняется свойство BST;
+ баланс-фактор каждого узла находится в диапазоне \\([-1,1]\\);
- после `insert()` и `delete()` дерево автоматически восстанавливает баланс;
+ `inorder` выводит значения в отсортированном порядке;
- все операции поиска, вставки и удаления выполняются за \\(O(\log n)\\) в худшем случае.

//==================================================

Код после 9 часов 14 минут 

*/

int main(){
    srand(time(NULL));
    Self_balanced_tree sbt;

    // int value;
    // for (size_t i = 0; i < 5; i++)
    // {
    //     value = rand()%100+1;
    //     cout << value << " ";
    //     sbt.insert(value);
    // }
    //=======================
    sbt.insert(33);//корректно
    sbt.insert(54);//корректно
    sbt.insert(57);
    sbt.insert(43);
    sbt.insert(52);
    cout<<"Full input!"<<endl;

    sbt.inorder();
    
    sbt.remove(52);
    cout<<"Произошло удаление 52!"<<endl;
    
    sbt.inorder();

    return 0;
}