#include "SBT_class.h"
#include <iostream>
using namespace std;

/*
76. Self-Balancing Binary Search Tree (AVL Tree)

Реализовать:

- `Insert` + автоматическая балансировка
- `Search`
- `Delete` + автоматическая балансировка
- поиск минимального элемента
- поиск максимального элемента
- обход дерева (`inorder = l -> n -> r`)
+ вычисление высоты узла (`height`) 
- вычисление баланс-фактора (`balanceFactor`)
- левый поворот (`rotateLeft`)
- правый поворот (`rotateRight`)
- балансировка узла (`balance`)
- обработка всех 4 случаев дисбаланса: LL, RR, LR, RL
- `clear()`
- деструктор AVL Tree

Тренирует: самобалансировку деревьев, рекурсивную перестройку структуры, 
//работу с указателями, анализ высоты, повороты дерева и поддержание свойств BST после вставки и удаления.

Критерии корректности:
- сохраняется свойство BST;
- баланс-фактор каждого узла находится в диапазоне \\([-1,1]\\);
- после `insert()` и `delete()` дерево автоматически восстанавливает баланс;
- `inorder` выводит значения в отсортированном порядке;
- все операции поиска, вставки и удаления выполняются за \\(O(\log n)\\) в худшем случае.

*/

int main(){
    
    Self_balanced_tree sbt;
    sbt.insert(55);

    cout<<"Command is working!"<<endl;

    return 0;
}