#include "SBT_class.h"
#include <iostream>
using namespace std;

// 76. Самобалансирующееся дерево
// Реализовать базовое самобалансирование BST:
// 	• проверку высоты поддеревьев
// 	• обнаружение дисбаланса
// 	• повороты дерева
// 	• восстановление баланса после вставки
// 	Минимальный объём:
// 		1. Реализовать height() и вычисление фактора баланса.
// 		2. Написать rotateLeft() и rotateRight().
// 		3. Научиться исправлять все четыре случая дисбаланса.
// 		4. Реализовать insert() с балансировкой.
// 		5. Проверить высоту дерева на возрастающей последовательности чисел.
// 		6. Разобраться, как балансировка должна работать после remove().
// 	Если времени мало, достаточно вставки, четырёх поворотов и понимания балансировки. Удаление в AVL можно разобрать теоретически и вернуться к нему позже.
// Тренирует: балансировку деревьев и понимание того, зачем вообще существуют самобалансирующиеся структуры.
// Но это можно считать подготовительным заданием перед красно-чёрным деревом, а не полноценным STL-аналогом.


int main(){



    return 0;
}